#Θέμα 3 πρώτο ερώτημα.

#Ορίζεται ο φάκελος που αποθηκεύει και αναζητά τα αρχεία.
setwd("C:\\Users\\admin\\OneDrive\\Υπολογιστής\\big data (1 project)")

#διαγράφει όλες τις μεταβλητές που βρίσκονται στο περιβάλλον εργασίας.
rm(list = ls())

#διαγράφει όλα τα διαγράμματα που έχουν δημιουργηθεί.
graphics.off()

# Διάβασμα αρχείου CSV και αποθήκευση σε μια μεταβλητή (π.χ., myData)
myData <- read.csv("taxpayers.csv")

# Υπολογισμός μέσου όρου εισοδήματος για άτομα με 2 ή περισσότερα παιδιά
mean_income <- mean(myData$Income[myData$NumChildren >= 2])

# Εκτύπωση του μέσου όρου
cat("Ο μέσος όρος εισοδήματος για άτομα με 2 ή περισσότερα παιδιά είναι:", mean_income, "\n")

